app/controllers/cars_controller.rb

SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2)
---
  def index
    @cars = Car.find_all_by_user_id(session[:user_id])

SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2 AND `cars`.`id` = '1') LIMIT 1
---
  def show
    @car = Car.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})

SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2 AND `cars`.`id` = '1') LIMIT 1
---
  def edit
    @car = Car.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})

INSERT INTO `cars` (`updated_at`, `acquisition`, `marque`, `manufactured`, `type`, `SPZ`, `user_id`, `created_at`) VALUES('2008-12-10 22:03:46', '2009-05-12', 'bbb', '2004-03-11', NULL, 'aaa', 2, '2008-12-10 22:03:46')
---
  def create
    @car = Car.new(params[:car])
    @car.user_id = session[:user_id]

    respond_to do |format|
      if @car.save

SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2 AND `cars`.`id` = '1') LIMIT 1
UPDATE `cars` SET `marque` = 'bb', `updated_at` = '2008-12-10 22:10:25' WHERE `id` = 1
---
  def update
    @car = Car.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @car
      flash[:notice] = 'Změna auta proběhla neúspěšně!'
      redirect_to :action => :index
      return
    end

    respond_to do |format|
      if @car.update_attributes(params[:car])

SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2 AND `cars`.`id` = '2') LIMIT 1
DELETE FROM `cars` WHERE `id` = 2
---
  def destroy
    @car = Car.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @car
      flash[:notice] = 'Žádné auto nebylo smazáno!'
      redirect_to :action => :index
      return
    end
    @car.destroy