app/controllers/cashbooks_controller.rb

SELECT * FROM `cashbooks` WHERE (`cashbooks`.`user_id` = 2)
---
  def index
    @cashbooks = Cashbook.find_all_by_user_id(session[:user_id])

SELECT * FROM `cashbooks` WHERE (`cashbooks`.`user_id` = 2 AND `cashbooks`.`id` = '1') LIMIT 1
SELECT * FROM `customers` WHERE (`customers`.`id` = 5)
---
  def show
    @cashbook = Cashbook.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @cashbook
      flash[:notice] = 'Tato položka není v peněžním deníku!'
      redirect_to :action => :index
      return
    end
    @customer = Customer.find(@cashbook.customer_id)

SELECT * FROM `customers` WHERE (`customers`.`user_id` = 2)
---
  def new
    @cashbook = Cashbook.new
    @customers = Customer.find_all_by_user_id(session[:user_id]).map { |c| [c.company, c.id]  }

SELECT * FROM `cashbooks` WHERE (`cashbooks`.`user_id` = 2 AND `cashbooks`.`id` = '1') LIMIT 1
SELECT * FROM `customers` WHERE (`customers`.`user_id` = 2)
---
  def edit
    @cashbook = Cashbook.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @cashbook
      flash[:notice] = 'Tato položka není v peněžním deníku!'
      redirect_to :action => :index
      return
    end
    @customer = Customer.find_all_by_user_id(session[:user_id]).map { |c| [c.company, c.id]  }

INSERT INTO `cashbooks` (`where`, `investment`, `updated_at`, `order`, `movement`, `amount`, `changes_base`, `DPH`, `what`, `when`, `user_id`, `comment`, `created_at`) VALUES(1, 1, '2008-12-19 12:28:58', NULL, 1, 1, 0, 2, 'Auto', '2004-12-19', 2, 'Libi se mi dlouhej text?', '2008-12-19 12:28:58')
---
  def create
    @cashbook = Cashbook.new(params[:cashbook])
    @cashbook.user_id = session[:user_id]

    respond_to do |format|
      if @cashbook.save

SELECT * FROM `cashbooks` WHERE (`cashbooks`.`id` = 1)
UPDATE `cashbooks` SET `changes_base` = 0, `movement` = 0, `investment` = 0, `where` = 0, `DPH` = 0, `updated_at` = '2008-12-19 16:31:39', `what` = 'p' WHERE `id` = 2
---
  def update
    @cashbook = Cashbook.find(params[:id])

    respond_to do |format|
      if @cashbook.update_attributes(params[:cashbook])

SELECT * FROM `cashbooks` WHERE (`cashbooks`.`user_id` = 2 AND `cashbooks`.`id` = '1') LIMIT 1
DELETE FROM `cashbooks` WHERE `id` = 1
---
  def destroy
    @cashbook = Cashbook.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @cashbook
      flash[:notice] = 'Tato položka není v peněžním deníku!'
      redirect_to :action => :index
      return
    end
    @cashbook.destroy