app/controllers/customers_controller.rb

SELECT * FROM `customers` WHERE (`customers`.`user_id` = 2) ORDER BY company
---
  def index
    @customers = Customer.find_all_by_user_id(session[:user_id])

SELECT * FROM `customers` WHERE (`customers`.`user_id` = 2 AND `customers`.`id` = '1') LIMIT 1
---
  def show
    @customer = Customer.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})

SELECT * FROM `customers` WHERE (`customers`.`user_id` = 2 AND `customers`.`id` = '1') LIMIT 1
---
  def edit
    @customer = Customer.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})

INSERT INTO `customers` (`company`, `updated_at`, `street`, `town`, `phone`, `fax`, `DIC`, `user_id`, `street_number`, `web`, `email`, `ICO`, `created_at`) VALUES('asdca', '2008-12-17 11:56:48', 'asdva', 'asv', 54, 654654, 56456, 5, 684, 'vadfv', 'fvafd', 54654, '2008-12-17 11:56:48')
---
  def create
    @customer = Customer.new(params[:customer])
    @customer.user_id = session[:user_id]


    respond_to do |format|
      if @customer.save

SELECT * FROM `customers` WHERE (`customers`.`user_id` = 5 AND `customers`.`id` = '7') LIMIT 1
UPDATE `customers` SET `phone` = 0, `web` = 'a', `fax` = 0, `town` = 'a', `ICO` = 0, `DIC` = 'a', `street` = 'a', `email` = 'a', `street_number` = 0, `updated_at` = '2009-01-03 17:49:15' WHERE `id` = 1
---
  def update
    @customer = Customer.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @customer
      flash[:notice] = 'Změna zákazníka proběhla neúspěšně!'
    redirect_to :action => :index
    return
    end

    respond_to do |format|
      if @customer.update_attributes(params[:customer])

SELECT * FROM `customers` WHERE (`customers`.`user_id` = 5 AND `customers`.`id` = '7') LIMIT 1
DELETE FROM `customers` WHERE `id` = 7
---
  def destroy
    @customer = Customer.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @customer
      flash[:notice] = 'Žádný zákazník nebyl smazán!'
      redirect_to :action => :index
      return
    end
    @customer.destroy