app/controllers/drivers_controller.rb

SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2)
---
  def index
    @drivers = Driver.find_all_by_user_id(session[:user_id])

SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2 AND `drivers`.`id` = '1') LIMIT 1
---
  def show
    @driver = Driver.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})

SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2 AND `drivers`.`id` = '2') LIMIT 1
---
  def edit
    @driver = Driver.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})

INSERT INTO `drivers` (`name`, `updated_at`, `driving_licence`, `personal_id`, `phone`, `user_id`, `surname`, `created_at`) VALUES('p', '2008-12-13 13:29:24', 'a1a1a1a', 111222233, 214587, 2, 'f', '2008-12-13 13:29:24')
---
  def create
    @driver = Driver.new(params[:driver])
    @driver.user_id = session[:user_id]

    respond_to do |format|
      if @driver.save

SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2 AND `drivers`.`id` = '2') LIMIT 1
UPDATE `drivers` SET `phone` = 0, `driving_licence` = 'a', `updated_at` = '2009-01-03 18:01:51', `personal_id` = 1 WHERE `id` = 2
---
  def update
    @driver = Driver.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @driver
      flash[:notice] = 'Změna řidiče proběhla neúspěšně!'
    redirect_to :action => :index
    return
    end

    respond_to do |format|
      if @driver.update_attributes(params[:driver])

SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2 AND `drivers`.`id` = '1') LIMIT 1
DELETE FROM `drivers` WHERE `id` = 1
---
  def destroy
    @driver = Driver.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @driver
      flash[:notice] = 'Žádný řidič nebyl smazán!'
      redirect_to :action => :index
      return
    end
    @driver.destroy