app/controllers/invoice_outs_controller.rb

SELECT * FROM `invoice_outs` WHERE (`invoice_outs`.`user_id` = 2)
---
  def index
    @invoice_outs = InvoiceOut.find_all_by_user_id(session[:user_id])

SELECT * FROM `invoice_outs` WHERE (`invoice_outs`.`user_id` = 2 AND `invoice_outs`.`id` = '1') LIMIT 1
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def show
    @invoice_out = InvoiceOut.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @invoice_out
      flash[:notice] = 'Tato faktura neexistuje!'
      redirect_to :action => :index
      return
    end
    @customer = Customer.find(@invoice_out.customer_id)

SELECT * FROM `invoice_outs` WHERE (`invoice_outs`.`user_id` = 2 AND `invoice_outs`.`id` = '1') LIMIT 1
---
  def edit
    @invoice_out = InvoiceOut.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})

INSERT INTO `invoice_outs` (`updated_at`, `number`, `customer_id`, `exposition`, `description`, `amount`, `user_id`, `maturity`, `created_at`) VALUES('2009-01-08 20:58:56', '1', 1, '2009-01-08', '1', 1, 2, '2009-01-08', '2009-01-08 20:58:56')
---
  def create
    @invoice_out = InvoiceOut.new(params[:invoice_out])
    @invoice_out.user_id = session[:user_id]

    respond_to do |format|
      if @invoice_out.save

SELECT * FROM `invoice_outs` WHERE (`invoice_outs`.`user_id` = 2 AND `invoice_outs`.`id` = '1') LIMIT 1
UPDATE `invoice_outs` SET `number` = 'a', `updated_at` = '2009-01-08 21:49:43' WHERE `id` = 1
---
  def update
    @invoice_out = InvoiceOut.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @invoice_out
      flash[:notice] = 'Tato faktura neexistuje!'
      redirect_to :action => :index
      return
    end

    respond_to do |format|
      if @invoice_out.update_attributes(params[:invoice_out])