app/controllers/invoice_ins_controller.rb

  def index
    @invoice_ins = InvoiceIn.find_all_by_user_id(session[:user_id])
---
SELECT * FROM `invoice_ins` WHERE (`invoice_ins`.`user_id` = 2)

  def show
    @invoice_in = InvoiceIn.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @invoice_in
      flash[:notice] = 'Tato faktura neexistuje!'
      redirect_to :action => :index
      return
    end
    @customer = Customer.find(@invoice_in.customer_id)
---
SELECT * FROM `invoice_ins` WHERE (`invoice_ins`.`user_id` = 2 AND `invoice_ins`.`id` = '1') LIMIT 1
SELECT * FROM `customers` WHERE (`customers`.`id` = 1)

  def edit
    @invoice_in = InvoiceIn.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
---
SELECT * FROM `invoice_ins` WHERE (`invoice_ins`.`user_id` = 2 AND `invoice_ins`.`id` = '1') LIMIT 1

  def create
    @invoice_in = InvoiceIn.new(params[:invoice_in])
    @invoice_in.user_id = session[:user_id]

    respond_to do |format|
      if @invoice_in.save
---
INSERT INTO `invoice_ins` (`updated_at`, `number`, `customer_id`, `exposition`, `description`, `amount`, `user_id`, `maturity`, `created_at`) VALUES('2009-01-08 21:15:03', '2', 1, '2009-01-08', '2', 2, 2, '2009-01-08', '2009-01-08 21:15:03')

  def update
    @invoice_in = InvoiceIn.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @invoice_in
      flash[:notice] = 'Tato faktura neexistuje!'
      redirect_to :action => :index
      return
    end

    respond_to do |format|
      if @invoice_in.update_attributes(params[:invoice_in])
---
SELECT * FROM `invoice_ins` WHERE (`invoice_ins`.`user_id` = 2 AND `invoice_ins`.`id` = '1') LIMIT 1
UPDATE `invoice_ins` SET `number` = 'a', `updated_at` = '2009-01-08 21:49:21' WHERE `id` = 1