app/controllers/journeys_controller.rb

  def index
    @journeys = Journey.find_all_by_user_id(session[:user_id])
    @cars = Car.find_all_by_user_id(session[:user_id])
    @drivers = Driver.find_all_by_user_id(session[:user_id])
---
SELECT * FROM `journeys` WHERE (`journeys`.`user_id` = 2)
SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2)
SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2)

  def show
    @journey = Journey.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @journey
      flash[:notice] = 'Tato služební cesta neexistuje!'
      redirect_to :action => :index
      return
    end
    @car = Car.find(@journey.car_id)
    @driver = Driver.find(@journey.driver_id)
---
SELECT * FROM `journeys` WHERE (`journeys`.`user_id` = 2 AND `journeys`.`id` = '1') LIMIT 1
SELECT * FROM `cars` WHERE (`cars`.`id` = 1)
SELECT * FROM `drivers` WHERE (`drivers`.`id` = 1)

  def new
    @journey = Journey.new
    @cars = Car.find_all_by_user_id(session[:user_id]).map { |c| [c.SPZ, c.id]  }
    @drivers = Driver.find_all_by_user_id(session[:user_id]).map { |d| [d.personal_id, d.id]  }
---
SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2)
SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2)

  def edit
    @journey = Journey.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @journey
      flash[:notice] = 'Tato služební cesta neexistuje!'
      redirect_to :action => :index
      return
    end
    @cars = Car.find_all_by_user_id(session[:user_id]).map { |c| [c.SPZ, c.id]  }
    @drivers = Driver.find_all_by_user_id(session[:user_id]).map { |d| [d.personal_id, d.id]  }
---
SELECT * FROM `journeys` WHERE (`journeys`.`user_id` = 2 AND `journeys`.`id` = '1') LIMIT 1
SELECT * FROM `cars` WHERE (`cars`.`user_id` = 2)
SELECT * FROM `drivers` WHERE (`drivers`.`user_id` = 2)

  def create
    @journey = Journey.new(params[:journey])
    @journey.user_id = session[:user_id]

    respond_to do |format|
      if @journey.save
---
INSERT INTO `journeys` (`begun`, `driver_id`, `purpose`, `updated_at`, `tachymetr_before`, `car_id`, `finished`, `from_where`, `to_where`, `user_id`, `tachymetr_after`, `created_at`) VALUES('2008-12-13 16:38:00', 1, 'moc keců', '2008-12-13 16:39:08', 500, 1, '2008-12-13 16:45:00', 'prdel1+č+šč', 'prdel2123', 2, 550, '2008-12-13 16:39:08')

  def update
    @journey = Journey.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @journey
      flash[:notice] = 'Změna služební cesty proběhla neúspěšně!'
      redirect_to :action => :index
      return
    end

    respond_to do |format|
      if @journey.update_attributes(params[:journey])
---
SELECT * FROM `journeys` WHERE (`journeys`.`user_id` = 2 AND `journeys`.`id` = '1') LIMIT 1
UPDATE `journeys` SET `tachymetr_after` = 0, `tachymetr_before` = 0, `updated_at` = '2009-01-03 19:16:28' WHERE `id` = 1