app/controllers/longtime_resources_controller.rb

  def index
    @longtime_resources = LongtimeResource.find_all_by_user_id(session[:user_id])
---
SELECT * FROM `longtime_resources` WHERE (`longtime_resources`.`user_id` = 2)

  def show
    @longtime_resource = LongtimeResource.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
---
SELECT * FROM `longtime_resources` WHERE (`longtime_resources`.`user_id` = 2 AND `longtime_resources`.`id` = '1') LIMIT 1

  def edit
    @longtime_resource = LongtimeResource.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
---
SELECT * FROM `longtime_resources` WHERE (`longtime_resources`.`user_id` = 2 AND `longtime_resources`.`id` = '1') LIMIT 1

  def create
    @longtime_resource = LongtimeResource.new(params[:longtime_resource])
    @longtime_resource.user_id = session[:user_id]

    respond_to do |format|
      if @longtime_resource.save
---
INSERT INTO `longtime_resources` (`name`, `initial_value`, `updated_at`, `first_rate`, `depreciation_type`, `depreciation_group`, `continue_rate`, `when`, `user_id`, `created_at`) VALUES('a', 0, '2009-01-04 23:00:47', 0, 0, 0, 0, '2009-01-04', 2, '2009-01-04 23:00:47')

  def update
    @longtime_resource = LongtimeResource.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
    unless @longtime_resource
      flash[:notice] = 'Změna majetku proběhla neúspěšně!'
      redirect_to :action => :index
      return
    end

    respond_to do |format|
      if @longtime_resource.update_attributes(params[:longtime_resource])
---
SELECT * FROM `longtime_resources` WHERE (`longtime_resources`.`user_id` = 2 AND `longtime_resources`.`id` = '1') LIMIT 1
UPDATE `longtime_resources` SET `depreciation_group` = 1, `depreciation_type` = 0, `initial_value` = 3, `first_rate` = 3, `continue_rate` = 3, `updated_at` = '2009-01-07 18:07:15' WHERE `id` = 1