app/controllers/tiny_resources_controller.rb

  def index
    @tiny_resources = TinyResource.find_all_by_user_id(session[:user_id])
---
SELECT * FROM `tiny_resources` WHERE (`tiny_resources`.`user_id` = 2)

  def show
    @tiny_resource = TinyResource.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
---
SELECT * FROM `tiny_resources` WHERE (`tiny_resources`.`user_id` = 2 AND `tiny_resources`.`id` = '1') LIMIT 1

  def edit
    @tiny_resource = TinyResource.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
---
SELECT * FROM `tiny_resources` WHERE (`tiny_resources`.`user_id` = 2 AND `tiny_resources`.`id` = '1') LIMIT 1

  def create
    @tiny_resource = TinyResource.new(params[:tiny_resource])
    @tiny_resource.user_id = session[:user_id]

    respond_to do |format|
      if @tiny_resource.save
---
INSERT INTO `tiny_resources` (`name`, `initial_value`, `updated_at`, `order`, `formatting`, `user_id`, `disposal`, `created_at`) VALUES('a', 0, '2009-01-04 23:01:07', 0, '2009-01-04', 2, '2009-01-04', '2009-01-04 23:01:07')

  def update
    @tiny_resource = TinyResource.find(:first, :conditions => {:id => params[:id], :user_id => session[:user_id]})
---
SELECT * FROM `tiny_resources` WHERE (`tiny_resources`.`user_id` = 2 AND `tiny_resources`.`id` = '1') LIMIT 1