app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def index
    if session[:root]
      @users = User.find(:all, :order => :name)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    if session[:root]
      @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def edit
    if session[:root]
      @user = User.find(params[:id])

INSERT INTO `users` (`name`, `updated_at`, `hashed_password`, `created_at`) VALUES('marcelka', '2008-12-17 11:55:52', '40bd001563085fc35165329ea1ff5c5ecbdbbeef', '2008-12-17 11:55:52')
---
  def create
    unless session[:root]
      return
    end
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-01-04 11:55:54', `name` = 'a' WHERE `id` = 2
---
  def update
    if session[:user_id] == User.find(params[:id]).id || session[:root]
      @user = User.find(params[:id])
      respond_to do |format|
        if @user.update_attributes(params[:user])